Cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id]) #why is there 'id:' in front sometimes